[
{"title": ["Learn How to Build an Incident Response Playbook Against Scattered Spider in Real-Time"], "date": ["Feb 20, 2024"], "htag": ["Webinar / Incident Response"], "label": ["\n", "\n", "\n"], "descr": [" In the tumultuous landscape of cybersecurity, the year 2023 left an indelible mark with the brazen exploits of the Scattered Spider threat group. Their attacks targeted the nerve centers of major financial and insurance institutions, culminating in what stands as one of the most impactful ransomware assaults in recent memory.  When organizations have no response plan in place for such an attack, it can become overwhelming attempting to prioritize the next steps that will have a compounding impact on the threat actor's ability to retain access to and control over a compromised network. Silverfort's threat research team interacted closely with the identity threats used by Scattered Spider. and in fact, built a response playbook in real time to respond to an active Scattered Spider attack. This webinar will dissect the real-life scenario in which they were called upon to build and execute a response plan while attackers were moving inside an organization's hybrid environme"]},
{"title": ["Iran and Hezbollah Hackers Launch Attacks to Influence Israel-Hamas Narrative"], "date": ["Feb 20, 2024"], "htag": ["Hacktivist / Cyber Attack"], "label": ["\n", "\n", "\n"], "descr": [" Hackers backed by Iran and Hezbollah staged cyber attacks designed to undercut public support for the Israel-Hamas war after October 2023. This includes destructive attacks against key Israeli organizations, hack-and-leak operations targeting entities in Israel and the U.S., phishing campaigns designed to steal intelligence, and information operations to turn public opinion against Israel. Iran accounted for nearly 80% of all government-backed phishing activity targeting Israel in the six months leading up to the October 7 attacks, Google said in a new report. \"Hack-and-leak and information operations remain a key component in these and related threat actors' efforts to telegraph intent and capability throughout the war, both to their adversaries and to other audiences that they seek to influence,\" the tech giant  said . But what's also notable about the Israel-Hamas conflict is that the cyber operations appear to be executed independently of the kinetic and batt"]},
{"title": ["Cybersecurity Tactics FinServ Institutions Can Bank On in 2024"], "date": ["Feb 14, 2024"], "htag": ["Financial Security / Cyber Threats"], "label": [], "descr": [" The landscape of cybersecurity in financial services is undergoing a rapid transformation. Cybercriminals are exploiting advanced technologies and methodologies, making traditional security measures obsolete. The challenges are compounded for community banks that must safeguard sensitive financial data against the same level of sophisticated threats as larger institutions, but often with more limited resources. The FinServ Threat Landscape Recent trends show an alarming increase in sophisticated cyber-attacks. Cybercriminals now deploy advanced techniques like deep fake technology and AI-powered attacks, making it increasingly difficult for banks to differentiate between legitimate and malicious activities. These developments necessitate a shift towards more sophisticated and adaptive cybersecurity measures. Take these industry statistics, for example. Financial firms report 703 cyberattack attempts per week.1 On average, 270 attacks (entailing unauthorized access of data, appl"]},
{"title": ["Microsoft, OpenAI Warn of Nation-State Hackers Weaponizing AI for Cyber Attacks"], "date": ["Feb 14, 2024"], "htag": ["Artificial Intelligence / Cyber Attack"], "label": ["\n", "\n", "\n"], "descr": [" Nation-state actors associated with Russia, North Korea, Iran, and China are experimenting with artificial intelligence (AI) and large language models (LLMs) to complement their ongoing cyber attack operations. The findings come from a report published by Microsoft in collaboration with OpenAI, both of which  said  they disrupted efforts made by five state-affiliated actors that used its AI services to perform malicious cyber activities by terminating their assets and accounts. \"Language support is a natural feature of LLMs and is attractive for threat actors with continuous focus on social engineering and other techniques relying on false, deceptive communications tailored to their targets' jobs, professional networks, and other relationships,\" Microsoft  said  in a report shared with The Hacker News. While no significant or novel attacks employing the LLMs have been detected to date, adversarial exploration of AI technologies has transcended various phases of the at"]},
{"title": ["The Critical State of AI in the Cloud"], "date": [], "htag": ["Artificial Intelligence / Cloud Security"], "label": ["Wiz.io"], "descr": ["Wiz Research reveals the explosive growth of AI adoption and what 150,000+ cloud accounts revealed about the AI surge."]},
{"title": ["U.S. DoJ Dismantles Warzone RAT Infrastructure, Arrests Key Operators"], "date": ["Feb 11, 2024"], "htag": ["Malware / Cybercrime"], "label": ["\n", "\n", "\n"], "descr": [" The U.S. Justice Department (DoJ) on Friday announced the seizure of online infrastructure that was used to sell a remote access trojan (RAT) called  Warzone RAT . The domains –  www.warzone[.]ws  and three others – were \"used to sell computer malware used by cybercriminals to secretly access and steal data from victims' computers,\" the DoJ  said . Alongside the takedown, the international law enforcement effort has arrested and indicted two individuals in Malta and Nigeria for their involvement in selling and supporting the malware and helping other cybercriminals use the RAT for malicious purposes. The defendants, Daniel Meli (27) and Prince Onyeoziri Odinakachi (31) have been charged with unauthorized damage to protected computers, with the former also accused of \"illegally selling and advertising an electronic interception device and participating in a conspiracy to commit several computer intrusion offenses.\" Meli is alleged to have offered malware se"]},
{"title": ["After FBI Takedown, KV-Botnet Operators Shift Tactics in Attempt to Bounce Back"], "date": ["Feb 07, 2024"], "htag": ["Malware / Network Security"], "label": ["\n", "\n", "\n"], "descr": [" The threat actors behind the  KV-botnet  made \"behavioral changes\" to the malicious network as U.S. law enforcement began issuing commands to neutralize the activity. KV-botnet is the name given to a network of compromised small office and home office (SOHO) routers and firewall devices across the world, with one specific cluster acting as a covert data transfer system for other Chinese state-sponsored actors, including  Volt Typhoon  (aka Bronze Silhouette, Insidious Taurus, or Vanguard Panda). Active since at least February 2022, it was  first documented  by the Black Lotus Labs team at Lumen Technologies in mid-December 2023. The botnet is known to comprise two main sub-groups, viz. KV and JDY, with the latter principally used for scanning potential targets for reconnaissance. Late last month, the U.S. government  announced  a court-authorized disruption effort to take down the KV cluster, which is typically reserved for manual operations against high-profile targets c"]},
{"title": ["Patchwork Using Romance Scam Lures to Infect Android Devices with VajraSpy Malware"], "date": ["Feb 05, 2024"], "htag": ["Cyber Espionage / Cyber Extortion"], "label": ["\n", "\n", "\n"], "descr": [" The threat actor known as Patchwork likely used romance scam lures to trap victims in Pakistan and India, and infect their Android devices with a remote access trojan called  VajraSpy . Slovak cybersecurity firm ESET said it uncovered 12 espionage apps, six of which were available for download from the official Google Play Store and were collectively downloaded more than 1,400 times between April 2021 and March 2023. \"VajraSpy has a range of espionage functionalities that can be expanded based on the permissions granted to the app bundled with its code,\" security researcher Lukáš Štefanko  said . \"It steals contacts, files, call logs, and SMS messages, but some of its implementations can even extract WhatsApp and Signal messages, record phone calls, and take pictures with the camera.\" As many as 148 devices in Pakistan and India are estimated to have been compromised in the wild. The malicious apps distributed via Google Play and elsewhere primarily masqueraded "]},
{"title": ["New Mispadu Banking Trojan Exploiting Windows SmartScreen Flaw"], "date": ["Feb 05, 2024"], "htag": ["Malware / Financial Security"], "label": ["\n", "\n", "\n"], "descr": [" The threat actors behind the Mispadu banking Trojan have become the latest to exploit a now-patched Windows SmartScreen security bypass flaw to compromise users in Mexico. The attacks entail a new variant of the malware that was first observed in 2019, Palo Alto Networks Unit 42 said in a report published last week. Propagated via phishing mails, Mispadu is a Delphi-based information stealer known to specifically infect victims in the Latin American (LATAM) region. In March 2023, Metabase Q  revealed  that Mispadu spam campaigns harvested no less than 90,000 bank account credentials since August 2022. It's also part of the larger family of LATAM banking malware, including  Grandoreiro , which was dismantled by Brazilian law enforcement authorities last week. The latest infection chain identified by Unit 42 employs rogue internet shortcut files contained within bogus ZIP archive files that leverage CVE-2023-36025 (CVSS score: 8.8), a high-severity bypass flaw in Windows Smar"]},
{"title": ["U.S. Sanctions 6 Iranian Officials for Critical Infrastructure Cyber Attacks"], "date": ["Feb 03, 2024"], "htag": ["Intelligence Agency / Cyber Security"], "label": ["\n", "\n", "\n"], "descr": [" The U.S. Treasury Department's Office of Foreign Assets Control (OFAC) announced sanctions against six officials associated with the Iranian intelligence agency for attacking critical infrastructure entities in the U.S. and other countries. The  officials  include Hamid Reza Lashgarian, Mahdi Lashgarian, Hamid Homayunfal, Milad Mansuri, Mohammad Bagher Shirinkar, and Reza Mohammad Amin Saberian, who are part of the Iranian Islamic Revolutionary Guard Corps Cyber-Electronic Command (IRGC-CEC). Reza Lashgarian is also the head of the IRGC-CEC and a commander in the IRGC-Qods Force. He is alleged to have been involved in various IRGC cyber and intelligence operations. The Treasury Department  said  it's holding these individuals responsible for carrying out \"cyber operations in which they hacked and posted images on the screens of programmable logic controllers manufactured by Unitronics, an Israeli company.\" In late November 2023, the U.S. Cybersecurity and Infras"]},
{"title": ["AnyDesk Hacked: Popular Remote Desktop Software Mandates Password Reset"], "date": ["Feb 03, 2024"], "htag": ["Cyber Attack / Software Security"], "label": ["\n", "\n", "\n"], "descr": [" Remote desktop software maker AnyDesk disclosed on Friday that it suffered a cyber attack that led to a compromise of its production systems. The German company said the incident, which it discovered following a security audit, is not a ransomware attack and that it has notified relevant authorities. \"We have revoked all security-related certificates and systems have been remediated or replaced where necessary,\" the company  said  in a statement. \"We will be revoking the previous code signing certificate for our binaries shortly and have already started replacing it with a new one.\" Out of an abundance of caution, AnyDesk has also revoked all passwords to its web portal, my.anydesk[.]com, and it's urging users to change their passwords if the same passwords have been reused on other online services. It's also recommending that users download the latest version of the software, which comes with a new  code signing certificate . AnyDesk did not disclose"]},
{"title": ["U.S. Feds Shut Down China-Linked \"KV-Botnet\" Targeting SOHO Routers"], "date": ["Feb 01, 2024"], "htag": ["Cyber Threat / Network Security"], "label": ["\n", "\n", "\n"], "descr": [" The U.S. government on Wednesday said it took steps to neutralize a botnet comprising hundreds of U.S.-based small office and home office (SOHO) routers hijacked by a China-linked state-sponsored threat actor called Volt Typhoon and blunt the impact posed by the hacking campaign. The existence of the botnet, dubbed  KV-botnet , was  first disclosed  by the Black Lotus Labs team at Lumen Technologies in mid-December 2023. The law enforcement effort was  reported  by Reuters earlier this week. \"The vast majority of routers that comprised the KV-botnet were Cisco and NetGear routers that were vulnerable because they had reached 'end of life' status; that is, they were no longer supported through their manufacturer's security patches or other software updates,\" the Department of Justice (DoJ)  said  in a press statement. Volt Typhoon  (aka DEV-0391, Bronze Silhouette, Insidious Taurus, or Vanguard Panda) is the moniker assigned to a China-based adversarial collect"]},
{"title": ["Hackers Exploiting Ivanti VPN Flaws to Deploy KrustyLoader Malware"], "date": ["Jan 31, 2024"], "htag": ["Cyber Attack / Network Security"], "label": ["\n", "\n", "\n"], "descr": [" A pair of recently disclosed zero-day flaws in Ivanti Connect Secure (ICS) virtual private network (VPN) devices have been exploited to deliver a Rust-based payload called  KrustyLoader  that's used to drop the open-source Sliver adversary simulation tool. The  security vulnerabilities , tracked as CVE-2023-46805 (CVSS score: 8.2) and CVE-2024-21887 (CVSS score: 9.1), could be abused in tandem to achieve unauthenticated remote code execution on susceptible appliances. As of January 26,  patches for the two flaws  have been delayed, although the software company has released a temporary mitigation through an XML file. Volexity, which first shed light on the shortcomings, said they have been weaponized as zero-days since December 3, 2023, by a Chinese nation-state threat actor it tracks under the name UTA0178. Google-owned Mandiant has assigned the moniker UNC5221 to the group. Following public disclosure earlier this month, the vulnerabilities have  come under broad exploitati"]},
{"title": ["Brazilian Feds Dismantle Grandoreiro Banking Trojan, Arresting Top Operatives"], "date": ["Jan 30, 2024"], "htag": ["Cyber Crime / Malware"], "label": ["\n", "\n", "\n"], "descr": [" A Brazilian law enforcement operation has led to the arrest of several Brazilian operators in charge of the  Grandoreiro  malware. The Federal Police of Brazil  said  it served five temporary arrest warrants and 13 search and seizure warrants in the states of São Paulo, Santa Catarina, Pará, Goiás, and Mato Grosso. Slovak cybersecurity firm ESET, which provided additional assistance in the effort, said it uncovered a design flaw in Grandoreiro's network protocol that helped it to identify the victimology patterns. Grandoreiro  is one of the many Latin American banking trojans such as Javali, Melcoz, Casabeniero, Mekotio, and Vadokrist, primarily targeting countries like Spain, Mexico, Brazil, and Argentina. It's known to be active since 2017. In late October 2023, Proofpoint  revealed  details of a phishing campaign that distributed an updated version of the malware to targets in Mexico and Spain. The banking trojan has capabilities to both steal data through keyloggers "]},
{"title": ["Microsoft Warns of Widening APT29 Espionage Attacks Targeting Global Orgs"], "date": ["Jan 26, 2024"], "htag": ["Threat Intelligence / Cyber Attack"], "label": ["\n", "\n", "\n"], "descr": [" Microsoft on Thursday said the Russian state-sponsored threat actors responsible for a  cyber attack on its systems  in late November 2023 have been targeting other organizations and that it's currently beginning to notify them. The development comes a day after Hewlett Packard Enterprise (HPE)  revealed  that it had been the victim of an attack perpetrated by a hacking crew tracked as  APT29 , which is also known as BlueBravo, Cloaked Ursa, Cozy Bear, Midnight Blizzard (formerly Nobelium), and The Dukes. \"This threat actor is known to primarily target governments, diplomatic entities, non-governmental organizations (NGOs) and IT service providers, primarily in the U.S. and Europe,\" the Microsoft Threat Intelligence team  said  in a new advisory. The primary goal of these espionage missions is to gather sensitive information that is of strategic interest to Russia by maintaining footholds for extended periods of time without attracting any attention. The latest disc"]},
{"title": ["Kasseika Ransomware Using BYOVD Trick to Disarm Security Pre-Encryption"], "date": ["Jan 24, 2024"], "htag": ["Ransomware / Endpoint Security"], "label": ["\n", "\n", "\n"], "descr": [" The ransomware group known as Kasseika has become the latest to leverage the Bring Your Own Vulnerable Driver ( BYOVD ) attack to disarm security-related processes on compromised Windows hosts, joining the likes of other groups like Akira , AvosLocker, BlackByte, and RobbinHood . The tactic allows \"threat actors to terminate antivirus processes and services for the deployment of ransomware,\" Trend Micro said in a Tuesday analysis. Kasseika, first discovered by the cybersecurity firm in mid-December 2023, exhibits overlaps with the now-defunct BlackMatter , which emerged in the aftermath of DarkSide's shutdown. There is evidence to suggest that the ransomware strain could be the handiwork of an experienced threat actor that acquired or purchased access to BlackMatter, given that the latter's source code has never publicly leaked post its demise in November 2021. Attack chains involving Kasseika commence with a phishing email for initial access, subsequently "]},
{"title": ["~40,000 Attacks in 3 Days: Critical Confluence RCE Under Active Exploitation"], "date": ["Jan 23, 2024"], "htag": ["Vulnerability / Cyber Attack"], "label": ["\n", "\n", "\n"], "descr": [" Malicious actors have begun to actively exploit a recently disclosed critical security flaw impacting Atlassian Confluence Data Center and Confluence Server, within three days of public disclosure. Tracked as CVE-2023-22527 (CVSS score: 10.0), the vulnerability impacts out-of-date versions of the software, allowing unauthenticated attackers to achieve remote code execution on susceptible installations. The shortcoming affects Confluence Data Center and Server 8 versions released before December 5, 2023, as well as 8.4.5. But merely days after the flaw became public knowledge, nearly 40,000 exploitation attempts targeting CVE-2023-22527 have been recorded in the wild as early as January 19 from more than 600 unique IP addresses, according to both the Shadowserver Foundation and the DFIR Report . The activity is currently limited \"testing callback attempts and 'whoami' execution,\" suggesting that threat actors are opportunistically scanning for vulnerable servers"]},
{"title": ["CISA Issues Emergency Directive to Federal Agencies on Ivanti Zero-Day Exploits"], "date": ["Jan 20, 2024"], "htag": ["Network Security / Threat Intelligence"], "label": ["\n", "\n", "\n"], "descr": [" The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday issued an  emergency directive  urging Federal Civilian Executive Branch (FCEB) agencies to implement mitigations against two actively exploited zero-day flaws in Ivanti Connect Secure (ICS) and Ivanti Policy Secure (IPS) products. The development arrives as the  vulnerabilities  – an authentication bypass (CVE-2023-46805) and a code injection bug (CVE-2024-21887) – have come under widespread exploitation by multiple threat actors. The flaws allow a malicious actor to craft malicious requests and execute arbitrary commands on the system. The U.S. company  acknowledged  in an advisory that it has witnessed a \"sharp increase in threat actor activity\" starting on January 11, 2024, after the shortcomings were publicly disclosed. \"Successful exploitation of the vulnerabilities in these affected products allows a malicious threat actor to move laterally, perform data exfiltration, and establish per"]}
]